Revit 2027 API
Duct.Create Method
Overload List
Name | Description
Create(Document, ElementId, ElementId, Connector, Connector) |  Creates a new duct that connects to two connectors.
Create(Document, ElementId, ElementId, Connector, XYZ) |  Creates a new duct that connects to the connector.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ) |  Creates a new duct from two points.
Top
See Also
Reference
Duct Class
Autodesk.Revit.DB.Mechanical Namespace